performance/tests/stockCards.yml
execution:
  - concurrency: 10
    iterations: 10
    ramp-up: 1m
    hold-for: 10m
    scenario: get-stock-cards

scenarios:
  get-stock-cards:
    variables:
      # Comfort Health Clinic
      facility_id: e6799d64-d10d-4011-b8c2-0e4d4a3f65ce
      # Essential Meds
      program_id: 10845cb9-d365-4aaa-badd-b4fa39c6a26a
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/stockCards?program=${program_id}&facility=${facility_id}
        method: GET
        label: GetStockCards
        headers:
          Authorization: Bearer ${access_token}

reporting:
  - module: passfail
    criteria:
      - 'GetStockCards too high error rate: failures>1%, continue as failed, label=GetStockCards, title="GetStockCards error rate too high"'
      - 'GetStockCards is too slow: p90>2500ms, stop as failed, label=GetStockCards, title="GetStockCards response time too high"'
      - 'GetStockCards needs improvement: p90>1500ms and p90<=2500ms, continue as passed, label=GetStockCards, title="GetStockCards needs improvement"'